//не пойму нужно решение писать здесь или питоновским файлом оформить. в общем и туда и сюда напишу

Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.


def filter_strings(arr):
    new_arr = []
    for s in arr:
        if len(s) <= 3:
            new_arr.append(s)
    return new_arr

# Примеры:
arr1 = ["Hello", "2", "world", ":-)"]
arr2 = ["1234", "1567", "-2", "computer science"]
arr3 = ["Russia", "Denmark", "Kazan"]

print(filter_strings(arr1))  # ["2", ":-)"]
print(filter_strings(arr2))  # ["-2"]
print(filter_strings(arr3))  # []